In [4]:
import warnings
warnings.filterwarnings("ignore")

# Packages

In [3]:
import mysql.connector as sqLtor

import csv
import pandas as pd

# Dot Environmen

In [2]:
# Actual API key is stored in a .env file.  Not good to store API key directly in script.
import os
from dotenv import load_dotenv

load_dotenv()
user = os.environ.get("user")
password = os.environ.get("password")

# SQL Connection

## Creating Database `org`

In [5]:
mycon0 = sqLtor.connect(host="localhost", user=user, passwd=password)
mycursor0 = mycon0.cursor()

In [6]:
mycursor0.execute("SHOW DATABASES")

for x in mycursor0:
  print(x)

('ecom',)
('information_schema',)
('mysql',)
('performance_schema',)
('python_db',)
('sys',)

In [7]:
mycursor0.execute("CREATE DATABASE org;")

In [8]:
mycursor0.close()

True

## Connect to Database `org`

In [5]:
mycon = sqLtor.connect(host="localhost", user=user, passwd=password, database="org")

In [6]:
cursor = mycon.cursor()

### Create tables

In [20]:
cursor.execute("""
CREATE TABLE Customers ( 
    CustomerID INT PRIMARY KEY, 
    Name VARCHAR(255),
    Email VARCHAR(255),
    JoinDate DATE );
""")

In [21]:
cursor.execute("""
CREATE TABLE Products ( 
    ProductID INT PRIMARY KEY, 
    Name VARCHAR(255), 
    Category VARCHAR(255), 
    Price DECIMAL(10, 2)
);
""")

In [22]:
cursor.execute("""
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE,
    TotalAmount DECIMAL(10, 2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
""")

In [23]:
cursor.execute("""
CREATE TABLE OrderDetails ( 
    OrderDetailID INT PRIMARY KEY, 
    OrderID INT,
    ProductID INT,
    Quantity INT,
    PricePerUnit DECIMAL(10, 2),
    FOREIGN KEY (OrderID) REFERENCES Orders(OrderID), 
    FOREIGN KEY (ProductID) REFERENCES Products(ProductID)
);
""")

In [24]:
cursor.execute("SHOW TABLES;")
data = cursor.fetchall()
for row in data:
    print(row)

('Customers',)
('OrderDetails',)
('Orders',)
('Products',)

In [18]:
# cursor.execute("DROP TABLE Customers;")

### Insert data into tables

#### Customers

In [25]:
customers = [
    "(1, 'Michelle Gonzalez', 'michellegonzalez@example.net', '2021-01-28')",
    "(2, 'Lauren Butler', 'laurenbutler@example.org', '2021-07-07')",
    "(3, 'Daniel Hunt', 'danielhunt@example.com', '2021-11-09')",
    "(4, 'James Clark', 'jamesclark@example.org', '2019-05-11')",
    "(5, 'Stephanie Monroe', 'stephaniemonroe@example.net', '2021-05-24')",
    "(6, 'Cynthia Shelton', 'cynthiashelton@example.org', '2022-06-09')",
    "(7, 'Anthony Wong', 'anthonywong@example.org', '2019-08-31')",
    "(8, 'Fred Hopkins', 'fredhopkins@example.org', '2021-10-06')",
    "(9, 'Glenn Vasquez', 'glennvasquez@example.com', '2021-02-12')",
    "(10, 'Scott Weaver', 'scottweaver@example.net', '2019-11-23')",
]

In [26]:
for customer in customers:
    cursor.execute(f"""
    INSERT INTO Customers(CustomerID, Name, Email, JoinDate)
                   VALUES{customer}
    """)

#### Products

In [27]:
products = [
    '(1, "C-IN2 Men\'s Pop Color Street Jock", "Active", 17.0)',
    '(2, "Carole Hochman Women\'s Long Zip Robe",  "Sleep & Lounge", 79)',
    "(3, 'Harbor Bay Big & Tall 2-Pack Plaid Woven Boxers', 'Underwear', 23.0)",
    "(4, 'Ralph Lauren Mens SB 2B Solid Navy Blue Wool Suit', 'Suits & Sport Coats', 319.99)",
    "(5, 'Aimee Gowns Original Bra-less Nursing Gown', 'Sleep & Lounge', 39.96)", 
    "(6, 'Premium White Above Ankle Toe Socks', 'Socks', 7.5)",
    '(7, "Mod-O-Doc Women\'s Big Cord Peacoat", "Outerwear & Coats", 170.0)',
    '(8, "True Religion Men\'s Geno Baja Slim Jean", "Jeans", 264.0)',
    '(9, "Larry Levine Women\'s Maxi Length Hooded Down Jacket", "Outerwear & Coats", 118.75)',
    '(10, "HUGO BOSS Men\'s Woven Long Elastic Pant", "Sleep & Lounge", 34.30)',
    '(11, "Michael Kors Men\'s Waffle Stitch Full Zip With Mock Neck", "Sweaters", 185.86)',
    '(12, "HUGO BOSS Men\'s Contrasting Stripe Crew Sock", "Socks", 13.0)',
    '(13, "Duofold Men\'s Big-Tall Heavy Weight Plus Crew Thermal Top", "Active", 33.98)',
    "(14, 'Allegra K Ladies Elastic Waist Sleeveless Side Pocket Tunic Jumpsuit Light Green XS', 'Jumpsuits & Rompers', 10.21)",
    "(15, 'KEEN Concord Stripe Crew Lite Sock', 'Socks & Hosiery', 17.0)",
    '(16, "Bobi Women\'s Modal Jersey Cowl Neck Dress", "Dresses", 60.0)',
    '(17, "Oakley Men\'s Flak Jacket XLJ Golf Sunglasses", "Accessories", 150.0)'
]

In [28]:
for product in products:
    cursor.execute(f"""
    INSERT INTO Products(ProductID, Name, Category, Price)
                   VALUES{product};
    """)

#### Orders

In [29]:
orders = [
    "(1, 5, '2021-07-23', 110.16)",
    "(2, 9, '2024-02-18', 191.48)",
    "(3, 7, '2020-07-30', 264)",
    "(4, 2, '2023-03-27', 17)",
    "(5, 4, '2022-11-12', 17)",
    "(6, 10, '2024-04-04', 319.98)",
    "(7, 3, '2022-07-19', 198.85)",
    "(8, 6, '2023-11-04', 170.0)",
    "(9, 7, '2023-12-17', 57.29)",
    "(10, 1, '2022-03-06', 197.75)"
]

In [30]:
for order in orders:
    cursor.execute(f"""
    INSERT INTO Orders(OrderID, CustomerID, OrderDate, TotalAmount)
                   VALUES{order};
    """)

#### OrderDetails

In [36]:
orderDetails = [
    "(1, 1, 5, 1, 39.95)",
    "(2, 4, 15, 1, 17.0)",
    "(3, 2, 17, 1, 150.0)",
    "(4, 10, 2, 1, 79.0)",
    "(5, 10, 9, 1, 118.75)",
    "(6, 1, 16, 1, 60.0)",
    "(7, 9, 10, 1, 34.3)",
    "(8, 6, 4, 1, 319.98)",
    "(9, 9, 3, 1, 23.0)",
    "(10, 2, 6, 1, 7.5)",
    "(11, 5, 1, 1, 17.0)",
    "(12, 1, 14, 1, 10.21)",
    "(13, 3, 8, 1, 264.0)",
    "(14, 7, 11, 1, 185.85)",
    "(15, 7, 12, 1, 13.0)",
    "(16, 2, 13, 1, 33.98)",
    "(17, 8, 7, 1, 170.0)",
]

In [37]:
for orderDetail in orderDetails:
    cursor.execute(f"""
    INSERT INTO OrderDetails(OrderDetailID, OrderID, ProductID, Quantity, PricePerUnit)
                   VALUES{orderDetail};
    """)

In [44]:
cursor.execute("FLUSH TABLES;")

In [35]:
cursor.execute("SELECT * FROM OrderDetails")
data = cursor.fetchall()
for row in data:
    print(row)

### Queries

#### Basics

1.1. List all customers.

In [20]:
cursor.execute("SELECT * FROM Customers;")
data = cursor.fetchall()
df = pd.DataFrame(data=data, columns=["CustomerID", "Name", "Email", "JoinDate"])
df.set_index("CustomerID")

                         Name                         Email    JoinDate
CustomerID
1           Michelle Gonzalez  michellegonzalez@example.net  2021-01-28
2               Lauren Butler      laurenbutler@example.org  2021-07-07
3                 Daniel Hunt        danielhunt@example.com  2021-11-09
4                 James Clark        jamesclark@example.org  2019-05-11
5            Stephanie Monroe   stephaniemonroe@example.net  2021-05-24
6             Cynthia Shelton    cynthiashelton@example.org  2022-06-09
7                Anthony Wong       anthonywong@example.org  2019-08-31
8                Fred Hopkins       fredhopkins@example.org  2021-10-06
9               Glenn Vasquez      glennvasquez@example.com  2021-02-12
10               Scott Weaver       scottweaver@example.net  2019-11-23

1.2. Show all products in the 'Active' category

In [21]:
cursor.execute("SELECT * FROM Products WHERE category='Active';")
data = cursor.fetchall()
df = pd.DataFrame(data=data, columns=["ProductID", "Name", "Category", "Price"])
df.set_index("ProductID")

                                                        Name Category  Price
ProductID
1                          C-IN2 Men's Pop Color Street Jock   Active  17.00
13         Duofold Men's Big-Tall Heavy Weight Plus Crew ...   Active  33.98

1.3. Find the total number of orders placed.

In [22]:
cursor.execute("SELECT COUNT(*) FROM Orders;")
data = cursor.fetchall()
for row in data:
    print(row)

(10,)

1.4. Display the details of the most recent order.

In [25]:
cursor.execute("""
SELECT * FROM OrderDetails 
    WHERE OrderID=(SELECT OrderID FROM 
               (SELECT * FROM Orders WHERE OrderDate=(SELECT MAX(OrderDate) FROM Orders)) ord1);
""")
data = cursor.fetchall()
df = pd.DataFrame(data=data, columns=["OrderDetailID", "OrderID", "ProductID", "Quantity", "PricePerUnit"])
df.set_index("OrderID")

         OrderDetailID  ProductID  Quantity PricePerUnit
OrderID
6                    8          4         1       319.98

#### Joins and Relationships

2.1. List all products along with the names of the customers who ordered them.

In [26]:
cursor.execute("""SELECT Products.*, OrderDetailsCustomers.Name AS Customer_Name 
               FROM Products
               RIGHT JOIN
               (SELECT OrderDetails.ProductID, OrdersCustomers.Name FROM OrderDetails
               RIGHT JOIN
               (SELECT Orders.OrderID, Customers.Name FROM Orders 
               INNER JOIN Customers ON Orders.CustomerID=Customers.CustomerID) AS OrdersCustomers
               ON OrderDetails.OrderID=OrdersCustomers.OrderID) AS OrderDetailsCustomers
               ON Products.ProductID=OrderDetailsCustomers.ProductID
               ORDER BY Customer_Name;""")
data = cursor.fetchall()
df = pd.DataFrame(data=data, columns=["ProductID", "Name", "Category", "Price", "Customer_Name"])
df.set_index("ProductID")

,Name,Category,Price,Customer_Name
ProductID,,,,
8,True Religion Men's Geno Baja Slim Jean,Jeans,264.00,Anthony Wong
10,HUGO BOSS Men's Woven Long Elastic Pant,Sleep & Lounge,34.30,Anthony Wong
3,Harbor Bay Big & Tall 2-Pack Plaid Woven Boxers,Underwear,23.00,Anthony Wong
7,Mod-O-Doc Women's Big Cord Peacoat,Outerwear & Coats,170.00,Cynthia Shelton
11,Michael Kors Men's Waffle Stitch Full Zip With...,Sweaters,185.86,Daniel Hunt
12,HUGO BOSS Men's Contrasting Stripe Crew Sock,Socks,13.00,Daniel Hunt
17,Oakley Men's Flak Jacket XLJ Golf Sunglasses,Accessories,150.00,Glenn Vasquez
6,Premium White Above Ankle Toe Socks,Socks,7.50,Glenn Vasquez
13,Duofold Men's Big-Tall Heavy Weight Plus Crew ...,Active,33.98,Glenn Vasquez
1,C-IN2 Men's Pop Color Street Jock,Active,17.00,James Clark
15,KEEN Concord Stripe Crew Lite Sock,Socks & Hosiery,17.00,Lauren Butler
2,Carole Hochman Women's Long Zip Robe,Sleep & Lounge,79.00,Michelle Gonzalez
9,Larry Levine Women's Maxi Length Hooded Down J...,Outerwear & Coats,118.75,Michelle Gonzalez
4,Ralph Lauren Mens SB 2B Solid Navy Blue Wool Suit,Suits & Sport Coats,319.99,Scott Weaver
5,Aimee Gowns Original Bra-less Nursing Gown,Sleep & Lounge,39.96,Stephanie Monroe
16,Bobi Women's Modal Jersey Cowl Neck Dress,Dresses,60.00,Stephanie Monroe
14,Allegra K Ladies Elastic Waist Sleeveless Side...,Jumpsuits & Rompers,10.21,Stephanie Monroe

2.2. Show orders that include more than one product.

In [34]:
cursor.execute("""
SELECT Orders.*, OrdersQuantity.Quantity FROM Orders
INNER JOIN
(SELECT OrderID, SUM(Quantity) AS Quantity
    FROM OrderDetails
    GROUP BY OrderID) AS OrdersQuantity
ON Orders.OrderID=OrdersQuantity.OrderID
WHERE OrdersQuantity.Quantity>1;
""")
data = cursor.fetchall()
df = pd.DataFrame(data=data, columns=["OrderID", "CustomerID", "OrderDate", "TotalAmount", "Number of Products"])
df.set_index("OrderID")

         CustomerID   OrderDate TotalAmount Number of Products
OrderID
1                 5  2021-07-23      110.16                  3
2                 9  2024-02-18      191.48                  3
7                 3  2022-07-19      198.85                  2
9                 7  2023-12-17       57.29                  2
10                1  2022-03-06      197.75                  2

2.3. Find the total sales amount for each customer.

In [ ]:
cursor.execute("""
SELECT Orders.*, OrdersQuantity.Quantity FROM Orders
INNER JOIN
(SELECT OrderID, SUM(Quantity) AS Quantity
    FROM OrderDetails
    GROUP BY OrderID) AS OrdersQuantity
ON Orders.OrderID=OrdersQuantity.OrderID
WHERE OrdersQuantity.Quantity>1;
""")
data = cursor.fetchall()
df = pd.DataFrame(data=data, columns=["OrderID", "CustomerID", "OrderDate", "TotalAmount", "Number of Products"])
df.set_index("OrderID")cursor.execute("""

#### Aggregation and Grouping

3.1. Calculate the total revenue generated by each product category.

3.2. Determine the average order value.

3.3. Find the month with the highest number of orders.

#### Subqueries and Nested Queries

4.1. Identify customers who have not placed any orders.

4.2. Find products that have never been ordered.

4.3. Show the top 3 best-selling products.

#### Date and Time Functions

5.1. List orders placed in the last month.

5.2. Determine the oldest customer in terms of membership duration.

#### Advanced Queries

6.1. Rank customers based on their total spending.

6.2. Identify the most popular product category.

6.3. Calculate the month-over-month growth rate in sales.

#### Data Manipulation and Updates

7.1. Add a new customer to the Customers table.

7.2. Update the price of a specific product.

# copy to csv-file

In [12]:
# rows = cursor.fetchall()
fp = open('./test.csv', 'w') ##different path but you get the idea
myFile = csv.writer(fp, lineterminator='\n')
myFile.writerows(data)
fp.close()